
## Plan Result (prod)




<pre><code>Plan: 6 to add, 29 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.shared_disk_backup[0]
  * azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup[&#34;prddartsassess&#34;]
  * azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup[&#34;prddartsassure&#34;]
  * azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup[&#34;prddartsmig01&#34;]
  * azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup[&#34;prddartsoracle&#34;]
  * azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup[&#34;prddartsunstr&#34;]
* Update
  * azurerm_linux_virtual_machine.dock-linux[&#34;prddartsmigdock&#34;]
  * azurerm_linux_virtual_machine.gitlab-linux[&#34;prddartsgitlab&#34;]
  * azurerm_linux_virtual_machine.migration[0]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdb01&#34;]
  * azurerm_linux_virtual_machine.migration-linux2[&#34;prddartsmigdb02&#34;]
  * azurerm_linux_virtual_machine.oracle[&#34;prddartsmigora01&#34;]
  * azurerm_logic_app_standard.logic[0]
  * azurerm_managed_disk.mig-01-disk[0]
  * azurerm_managed_disk.shared_disk[0]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassess&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassure&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig05&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsoracle&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsunstr&#34;]
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
  * module.vm-bootstrap-migration_vms[&#34;prddartsassess&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsassure&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig01&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig02&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig03&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig04&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsmig05&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsoracle&#34;].azurerm_virtual_machine_extension.custom_script[0]
  * module.vm-bootstrap-migration_vms[&#34;prddartsunstr&#34;].azurerm_virtual_machine_extension.custom_script[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.dock-linux["prddartsmigdock"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "dock-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdock"
        name                                                   = "prddartsmigdock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.gitlab-linux["prddartsgitlab"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "gitlab-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsgitlab"
        name                                                   = "prddartsgitlab"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                                                   = "migration-vm"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdb01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb01"
        name                                                   = "prddartsmigdb01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux2["prddartsmigdb02"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux2" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb02"
        name                                                   = "prddartsmigdb02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.oracle["prddartsmigora01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "oracle" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigora01"
        name                                                   = "prddartsmigora01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_logic_app_standard.logic[0] will be updated in-place
  ~ resource "azurerm_logic_app_standard" "logic" {
      ~ app_settings                             = {
          - "FUNCTIONS_WORKER_RUNTIME" = "dotnet" -> null
        }
        id                                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Web/sites/darts-migration-logic-prod"
        name                                     = "darts-migration-logic-prod"
        tags                                     = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_managed_disk.mig-01-disk[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "mig-01-disk" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/migration-shared-disk"
        name                              = "migration-shared-disk"
      ~ tags                              = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.shared_disk[0] will be updated in-place
  ~ resource "azurerm_managed_disk" "shared_disk" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/disks/shared-disk"
        name                              = "shared-disk"
      ~ tags                              = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (31 unchanged attributes hidden)
    }

  # azurerm_managed_disk.shared_disk_backup[0] will be created
  + resource "azurerm_managed_disk" "shared_disk_backup" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 4000
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = 5
      + name                              = "shared-disk-backup"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "darts-migration-prod-rg"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tier                              = (known after apply)
    }

  # azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup["prddartsassess"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "shared_disk_attachment_backup" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 3
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup["prddartsassure"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "shared_disk_attachment_backup" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 3
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup["prddartsmig01"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "shared_disk_attachment_backup" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 3
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup["prddartsoracle"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "shared_disk_attachment_backup" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 3
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsoracle"
      + write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.shared_disk_attachment_backup["prddartsunstr"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "shared_disk_attachment_backup" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 3
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsunstr"
      + write_accelerator_enabled = false
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassess"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
        name                                                   = "prddartsassess"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassure"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
        name                                                   = "prddartsassure"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig01"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
        name                                                   = "prddartsmig01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig02"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02"
        name                                                   = "prddartsmig02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig03"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03"
        name                                                   = "prddartsmig03"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig04"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04"
        name                                                   = "prddartsmig04"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig05"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05"
        name                                                   = "prddartsmig05"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsoracle"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsoracle"
        name                                                   = "prddartsoracle"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsunstr"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsunstr"
        name                                                   = "prddartsunstr"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Storage/storageAccounts/dartssaprod"
        name                               = "dartssaprod"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02"
        name                               = "saproddartsmig02"
        tags                               = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsassess"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsassure"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig01"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig02"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig03"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig04"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsmig05"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsoracle"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsoracle/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vm-bootstrap-migration_vms["prddartsunstr"].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsunstr/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 29 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":366,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->